1)Ваш друг планирует купить новые кроссовки и решил ежедневно откладывать на это небольшую сумму.
 Напишите программу, которая поможет ему следить за накоплениями. С помощью переменной days задайте количество дней,
  в течение которых он будет копить, а сумма ежедневных взносов пусть хранится в переменной moneyPerDay.
   Определите значения этих переменных в коде так, чтобы программа напечатала следующее:
День 1. Уже 200 руб.
День 2. Уже 400 руб.
День 3. Уже 600 руб.
День 4. Уже 800 руб.
День 5. Уже 1000 руб. 

2)Байт тем временем налёг на новый корм — съедает по целой пачке в день.
Ветеринар считает, что это не очень полезно, и порекомендовал делить пачку на три дня.
Вы, как обычно, отложили на корм 500 рублей. Подсчитайте с помощью цикла, на сколько дней вам хватит этих денег,
 если одна пачка корма для Байта стоит 100 рублей.
 Ваша программа должна выводить каждый трёхдневный период и остаток средств к этому моменту:
На 3-й день останется 400 рублей.
На 6-й день останется 300 рублей.
На 9-й день останется 200 рублей.
На 12-й день останется 100 рублей.
На 15-й день останется 0 рублей.
Денег хватит на 15 дней. 

3) Перед вами массив трат за неделю. Каждый его элемент — это сумма, потраченная за один день,
 от понедельника до воскресенья.
Сделайте следующее:
Исправьте сумму расходов за среду: в ней не отражено мороженое, купленное за 115 рублей.
Прибавьте стоимость десерта к расходам за день.
Суммируйте три самые крупные траты в массиве — это расходы за вторник, пятницу и субботу.
 Результат сохраните в переменную sum.
    public static void main(String[] args) {
        double[] expenses = {100.50, 500.00, 10.00, 0.0, 640.60, 370.20, 200.00};

        // Добавьте 115 рублей к расходам за среду
        ...
        System.out.println("Новое значение расходов за среду: " + ... + " рублей.");

        // Суммируйте три самые крупные траты
        ...
        System.out.println("Самые большие расходы были во вторник, пятницу и субботу.");
        System.out.println("Всего вы потратили в эти дни: " + ... + " рублей.");
    }
	
4) Ваш коллега запланировал на год дюжину классных целей и составил из них список в порядке приоритетности.
Однако сразу после новогодних каникул планы изменились.
Командировка в Китай отложена на весну,
а вот диван нужен срочно — в гости приедут друзья.
Поездка в Японию вообще сорвалась — решено отдыхать в Сочи.
Вам нужно помочь коллеге объявить массив для его планов и внести в него изменения:
поменять местами поездку в Китай и покупку дивана,
а отпуск в Японии заменить отпуском в Сочи. Изменения в планах напечатайте,
используя их порядковые номера в списке.

    public static void main(String[] args) {
        // На месте многоточия объявите массив plans
        ... = {"Поехать в Китай по работе",
                "Отметить день рождения с друзьями",
                "Обустроить рабочее место",
                "Научиться вести бюджет",
                "Купить диван",
                "Поехать на музыкальный фестиваль",
                "Попросить на работе один удалённый день в неделю",
                "Заняться спортом",
                "Поехать в Японию в отпуск",
                "Начать внедрять zero waste-подходы в повседневную жизнь",
                "Встречаться с друзьями не реже раза в неделю",
                "Перестать есть в кровати"
        };

        // Поменяйте местами покупку дивана и поездку в Китай в три шага, используя swap
        String swap = ...; // Присвойте swap значение элемента, который вы заменяете
        ...; // Присвойте значение одного элемента другому
        ... = swap; // В swap должно оказаться значение элемента, выбранного на замену

        // Замените фразу "Поехать в Японию в отпуск" на "Поехать в Сочи в отпуск"
        ...

        System.out.println("Изменения в планах:");
        System.out.println("1. " + ...);
        System.out.println(...);
        System.out.println(...);

    }
	
5) Банк разрабатывает для своих клиентов валютный кошелёк для путешествий. Базово в нём собраны всё те же четыре валюты:
доллары, евро, иены и рубли. Однако в зависимости от того, в какую страну отправляется клиент банка, валюты можно будет менять.
 Пока доступных опций немного: при поездке в Данию евро можно поменять на кроны, а при поездке в Китай иены на юани.
  Допишите программу таким образом, чтобы она сначала спрашивала у пользователя, куда он планирует отправиться,
   в Данию или Китай, и в зависимости от выбора варианта меняла валюту в базовом наборе кошелька.
   Используйте конструкцию с условным выражением.
    public static void main(String[] args) {
        String[] currencies = {"USD","EUR","JPY","RUB"};

        System.out.println("В вашем тревел-кошельке доступны следующие валюты:");
        System.out.println(currencies[0]);
        System.out.println(currencies[1]);
        System.out.println(currencies[2]);
        System.out.println(currencies[3]);

        Scanner scanner = new Scanner(System.in);
        System.out.println("Если вы планируете поездку в Данию, введите 1, а если в Китай, введите 2");

        int country = ...;  // Считайте из консоли ввод пользователя
 
        // Если выбрана Дания, измените значение элемента евро на кроны DKK
        ...
        // Если Китай, измените значение элемента иена на юани CNY
        ...

        System.out.println("В вашем тревел-кошельке доступны следующие валюты:");
        System.out.println(currencies[0]);
        System.out.println(currencies[1]);
        System.out.println(currencies[2]);
        System.out.println(currencies[3]);
    }